Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Select the riscos hint file.
es_es: Seleccione el archivo de pistas para riscos.

source: If the C<open> involved a pipe, the return value happens to be the pid of the subprocess.
es_es: Si el C<open> contiene una tubería, el valor de retorno pasa a ser el pid del subproceso.

source: Note: not all implementations are capable of returning the $timeleft.
es_es: Nota: no todas las implementaciones son capaces de devolver $tiempo_restante.

source: chomp($answer = <STDIN>);
es_es: chomp($respuesta = <STDIN>);

source: # the first integer after the first = sign, or the
es_es: # el primer entero después del signo =, o, de otra forma, todo

source: The typical input/output flow of a program is:
es_es: El flujo de entrada/salida típico de un programa es:

source: In addition, subroutines are named with an initial '&', though this is optional when unambiguous, just as the word "do" is often redundant in English.
es_es: Además de lo anterior, las subrutinas se nombran empezando por '&', aunque ésto es opcional cuando no provoque ambigüedad, igual que el sujeto de una frase en español es a menudo redundante cuando va implícito en el verbo, como en "(yo) tengo lo que usted necesita".

source: 5 gid 5 year-1900 5 wantarray $!
es_es: 5 gid 5 año-1900 5 wantarray $!

source: a filetest operator, with the exception of C<-s>, C<-M>, C<-A>, and C<-C>, that return numerical values, not boolean ones.
es_es: un operador de test de archivo, con la excepción de C<-s>, C<-M>, C<-A>, y C<-C>, que devuelven valores numéricos, no booleanos.

source: This time all must be OK.
es_es: Esta vez, todo debe estar bien.

source: + Match 1 or more times
es_es: + Coincide con 1 o más veces

source: Produces a fatal error if used on a machine that doesn't implement flock(2), fcntl(2) locking, or lockf(3).
es_es: Produce un error fatal si se usa en una máquina que no implemente flock(2), bloqueo fcntl(2), o lockf(3).

source: =item Functions for filehandles, files, or directories X<file> X<filehandle> X<directory> X<pipe> X<link> X<symlink>
es_es: =item Funciones para identificadores de archivo, archivos y directorios X<file> X<filehandle> X<directory> X<pipe> X<link> X<symlink> X<archivo> X<identificador de archivo> X<enlace>

source: If you are upgrading from an earlier release such as 5.6.1, first read the L<perl58delta>, which describes differences between 5.6.0 and 5.8.0.
es_es: Si está actualizando desde una versión anterior como la 5.6.1, primero lea L<perl58delta>, que describe las diferencias entre 5.6.0 y la 5.8.0.

source: And note that C</x> doesn't affect space interpretation within a single multi-character construct.
es_es: Y tenga en cuenta que C</x> no afecta a la interpretación del espacio en el interior de la construcción de un multicarácter.

source: C<perl -i> could C<fchmod(stdin)> by mistake.
es_es: C<perl -i> podría hacer C<fchmod(stdin)> por error.

source: On many Unix systems, fdopen() fails when file descriptors exceed a certain value, typically 255.
es_es: En muchos sistemas Unix, fdopen() falla cuando los descriptores de archivo exceden de un valor determinado, por lo general, 255.

source: by Dave Cross
es_es: Dave Cross

source: Different definitions of Perl are given in L<perl>, L<perlfaq1> and no doubt other places.
es_es: En L<perl>, L<perlfaq1> y en muchos otros sitios se incluyen definiciones de Perl.

source: =head3 Capture groups
es_es: =head3 Grupos de captura

source: @contact = sort &find_records(@key);
es_es: @contacto = sort &busca_registros(@claves);

source: print join(", ", reverse "world", "Hello"); # Hello, world
es_es: print join(", ", reverse "mundo", "Hola"); # Hola, mundo

source: On Win32, Perl can now use non-IFS compatible LSPs, which allows Perl to work in conjunction with firewalls such as McAfee Guardian.
es_es: En Win32, Perl ahora puede usar no-IFS compatibles con LSP, que permite a Perl trabajar en conjunto con cortafuegos como McAfee Guardian.

source: This assignment:
es_es: Esta asignación:

source: Some new features were added, e.g. the broot() method, you can now pass parameters to config() to change some settings at runtime, and it is now possible to trap the creation of NaN and infinity.
es_es: Algunas nuevas características han sido añadidas, por ejemplo, al método broot() ahora puede pasarle parámetros a config() para cambiar algunos ajustes en tiempo de ejecución, y ahora es posible atrapar la creación de NaN e infinity.

source: | ^ REGEX METACHARS REGEX MODIFIERS
es_es: | ^ METACARACTERES EXP. REG. MODIFICADORES EXP. REG.

source: ActiveState: Windows, Linux, Mac OS X, Solaris, AIX and HP-UX
es_es: ActiveState: Windows, Linux, Mac OS X, Solaris, AIX y HP-UX

source: When using a character valid in an identifier, whitespace is required after the C<m>.
es_es: Cuando se utiliza un carácter válido en un identificador, se requiere espacios en blanco después de la C<m>.

source: They are only required occasionally to clarify issues of precedence.
es_es: Solo son necesarios en algunos casos para aclarar la precedencia.

source: As documented in L<overload>, this conversion will work only over literal parts of regular expressions.
es_es: Como se documenta en L<overload>, esta conversión funcionará solo en las partes literales de las expresiones regulares.

source: left || //
es_es: izquierda || //

source: my ($self, $filename) = @_;
es_es: my ($self, $archivo) = @_;

source: C<warn()> or C<carp()> a message to STDERR.
es_es: Un mensaje C<warn()> o C<carp()> a STDERR.

source: You can get at lists of keys and values with C<keys()> and C<values()>.
es_es: Puede obtener una lista de las claves y los valores con C<keys()> y C<values()> respectivamente.

source: You can exclude the beginning point by waiting for the sequence number to be greater than 1.
es_es: Puede excluir el punto de partida esperando por un número de secuencia mayor que 1.

source: INSTALLATION
es_es: INSTALACIÓN

source: So by storing a reference as the value of an array or hash element, you can easily create lists and hashes within lists and hashes.
es_es: Así, almacenando una referencia como el valor de un elemento de array o hash, puede crear fácilmente listas y hashes dentro de listas y hashes.

source: Calls the System V IPC function shmctl.
es_es: Llama a la función System V IPC shmctl(2).

source: C<i!> and C<I!> are also allowed, but only for completeness' sake: they are identical to C<i> and C<I>.
es_es: C<i!> y C<I!> también están permitidos, pero solo a efectos de completar: son idénticos a C<i> y C<I>.

source: The Perl Foundation is an advocacy organization for the Perl language which maintains the web site ( http://www.perl.org/ ) as a general advocacy site for the Perl language.
es_es: The Perl Foundation es una organización que respalda al lenguaje Perl y mantiene un sitio web ( http://www.perl.org/ ) como recurso general de apoyo a Perl.

source: You have to use the default variable C<$_>.
es_es: Tiene que usar la variable por defecto C<$_>.

source: Styles and techniques will therefore differ, although some effort has been made to not vary styles too widely in the same sections.
es_es: Por esta razón, habrá diversos estilos y técnicas, pero se ha procurado que en una misma sección los estilos no varíen demasiado.

source: perlipc Perl interprocess communication
es_es: perlipc Comunicación entre procesos

source: For C<pack>, I<sequence-item> may have a repeat count, in which case the minimum of that and the number of available items is used as the argument for I<length-item>.
es_es: Para C<pack>, I<secuencia-item> puede tener un contador de repeticiones, en cuyo caso el mínimo de él y del número de elementos disponibles es usado como el argumento para <longitud-item>.

source: Hmm... that's still a bit ugly.
es_es: Hmm ... que aún es un poco feo.

source: Math::BigInt upgraded to version 1.73
es_es: Math::BigInt actualizado a la versión 1.73

source: Unlike most Unix utilities, Perl does not arbitrarily limit the size of your data--if you've got the memory, Perl can slurp in your whole file as a single string.
es_es: A diferencia de la mayoría de las utilidades Unix, Perl no limita de forma arbitraria el tamaño de los datos; si el sistema dispone de memoria suficiente, puede "succionar" un archivo completo como una sola cadena.

source: Do one thing and do it well
es_es: Haga una cosa y hágala bien

source: You should in general be leery of using functions that could potentially return lists in scalar context without explicitly stating such.
es_es: Debe, por lo general, desconfiar del uso de funciones que podrían devolver listas en contexto escalar sin constancia explícita de ello.

source: \() list of refs NUMBERS vs STRINGS LINKS
es_es: \() lista referencias NÚMEROS CADENAS VÍNCULOS

source: /^\d+/ string starts with one or more digits
es_es: /^\d+/ cadena que empieza por uno o varios dígitos

source: Normal arrays are ordered lists of scalars indexed by number, starting with 0.
es_es: Los arrays normales son listas ordenadas de escalares indexadas por números, empezando por 0.

source: Unicode is encoded using several competing encodings, of which UTF-8 is the most used.
es_es: Existen varias codificaciones de Unicode en competencia, de las cuales la más utilizada es UTF-8.

# print "THIS and THAT are dups ";
source: print "THIS and THAT are dups\n";
es_es: print "THIS Y THAT son duplicados\n";

source: Updated to version 3.49.
es_es: Actualizado a la versión 3.49.

source: You may also, in the Bourne shell tradition, specify an EXPR beginning with C<< >& >>, in which case the rest of the string is interpreted as the name of a filehandle (or file descriptor, if numeric) to be duped (as C<dup(2)>) and opened.
es_es: Puede también, en la tradición de Bourne shell, especificar una EXPR comenzando con C<< >& >>, en cuyo caso el resto de la cadena se interpreta como el nombre de un identificador de archivo (o descriptor de archivo, si es numérico) para que sea duplicado (con C<dup(2)>) y luego abierto.

source: Unless the C</r> option is used, the string specified with C<=~> must be a scalar variable, an array element, a hash element, or an assignment to one of those; in other words, an lvalue.
es_es: A menos que se use la opción C</r>, la cadena especificada con C<=~> debe ser una variable escalar, un elemento de un array, un elemento hash, o una asignación a una de estas, es decir, un I<ivalor>.

source: To use state variables, one needs to enable them by using
es_es: Para utilizar las variables C<state>, es necesario que las active mediante el uso de

source: But, Unicode properties can have spaces, so in C<\p{...}> there can be spaces that follow the Unicode rules, for which see L<perluniprops/Properties accessible through \p{} and \P{}>.
es_es: Pero, las propiedades Unicode pueden tener espacios, por lo que en C<\p{...}> puede haber espacios que sigan las reglas Unicode, para lo cual vea L<perluniprops.pod/Propiedades accesibles a través de \p{} y \P{}>.

source: This gives users the freedom of choice: if they want protected files, they might choose process umasks of C<022>, C<027>, or even the particularly antisocial mask of C<077>.
es_es: Esto ofrece a los usuarios la libertad de elección: si quieren archivos protegidos, podrían elegir un umasks para el proceso de C<022>, C<027>, o incluso la máscara, particularmente antisocial, de C<077>.

source: When LAYER is present, using binmode on a text file makes sense.
es_es: Tiene sentido que CAPA esté presente, al usar binmode sobre un archivo de texto.

source: If you want to learn more about Perl 6, or have a desire to help in the crusade to make Perl a better place then read the Perl 6 developers page at http://dev.perl.org/perl6/ and get involved.
es_es: Si desea obtener más información sobre Perl 6 o ayudar en la cruzada para mejorar Perl, visite la página para desarrolladores de Perl 6 en http://dev.perl.org/perl6/ y anímese a participar en el proyecto.

source: Note that if you have to look for strings that you don't know till runtime, you can build an entire loop as a string and C<eval> that to avoid recompiling all your patterns all the time.
es_es: Tenga en cuenta que si usted tiene que buscar en cadenas que no sabe hasta el tiempo de ejecución, puede crear un bucle completo como una cadena y luego hacerle un C<eval>, para evitar tener que volver a recompilar todos los patrones todo el tiempo.

source: Computing MROs can be expensive.
es_es: Calcular MRO puede ser costoso.

source: Automatic tab indexes are now disabled and new C<-tabindex> pragma has been added to turn automatic indexes back on
es_es: Ahora están desactivados los índices automáticos de tabulación, y se ha añadido un nuevo pragma para volverlos a activar

source: On a binary string, you would do things like:
es_es: Con una cadena binaria puede realizar operaciones como estas:

source: The following are equivalent:
es_es: Lo siguiente es equivalente:

source: C<Configure> now invokes callbacks regardless of the value of the variable they are called for.
es_es: C<Configure> ahora invoca retrollamadas, independientemente del valor de la variable que se requiera.

source: Self-explanatory.
es_es: Se explica por sí mismo.

source: Most of the major modules (C<Tk>, C<CGI>, C<libwww-perl>) have their own mailing lists.
es_es: La mayoría de los módulos importantes (C<Tk>, C<CGI>, C<libwww-perl>) tienen su propia lista de correo.

source: perl Perl overview (this section)
es_es: perl Información general sobre Perl (esta sección)

source: If your stdio requires a seek or eof between reads and writes on a particular stream, so does Perl.
es_es: Si stdio requiere ejecutar seek o eof entre lecturas y escrituras para una secuencia determinada, Perl también lo requerirá

source: =item tr/SEARCHLIST/REPLACEMENTLIST/cdsr X<tr> X<y> X<transliterate> X</c> X</d> X</s>
es_es: =item tr/LISTA_BÚSQUEDA/LISTA_REEMPLAZO/cdsr X<tr> X<y> X<transliterate> X</c> X</d> X</s> X<transliterar>

source: If C<$_> is lexical in the scope where the C<grep> appears (because it has been declared with C<my $_>) then, in addition to being locally aliased to the list elements, C<$_> keeps being lexical inside the block; i.e., it can't be seen from the outside, avoiding any potential side-effects.
es_es: Si C<$_> es léxica en el ámbito de aplicación donde C<grep> aparece (porque se ha declarado con C<my $_>) entonces, además de ser un alias local a los elementos de la lista, C<$_> se mantiene léxica dentro del bloque; es decir, no puede ser vista desde el exterior, evitando cualquier potencial efecto colateral.

source: Binary "xor" returns the exclusive-OR of the two surrounding expressions.
es_es: Binario "xor" devuelve la OR exclusiva de las dos expresiones que la rodean.

source: Binary "*" multiplies two numbers.
es_es: Binario "*" multiplica dos números.

source: the key 12345 will get stored in the DBM database as the 5 byte string "12345".
es_es: la clave 12345 se almacenará en la base de datos DBM como una cadena de 5 bytes, "12345".

source: The added randomness may affect applications.
es_es: La aleatoriedad añadida puede afectar a las aplicaciones.

source: Good places to look for pre-existing modules include http://search.cpan.org/ and asking on modules@perl.org
es_es: Un buen lugar para buscar módulos pre-existentes incluye http://search.cpan.org/ y preguntar en modules@perl.org

source: (The following all specify the same class of three characters: C<[-az]>, C<[az-]>, and C<[a\-z]>.
es_es: (Los siguientes ejemplos especifican la misma clase de tres caracteres: C<[-az]>, C<[az-]> y C>[a\-z]>.

source: You can get more documentation, tutorials and community support online at L<http://www.perl.org/>.
es_es: Puede obtener más documentación, tutoriales y soporte de la comunidad en línea en L<http://www.perl.org/>.

source: If you need to use a typeglob to save away a filehandle, do it this way:
es_es: Si necesita utilizar un typeglob para guardar un identificador de archivo, hágalo de esta manera:

source: C<POSIX> upgraded to version 1.09
es_es: C<POSIX> actualizado a la versión 1.09

source: =item uc EXPR X<uc> X<uppercase> X<toupper>
es_es: =item uc EXPR X<uc> X<uppercase> X<toupper> X<mayúsculas>

source: If C<$@> is empty then the string C<"Died"> is used.
es_es: Si C<$@> está vacío entonces se usa la cadena C<"Died">.

source: C</o> is described in the next section.
es_es: C</o> se describe en la siguiente sección.

source: Because the mode contains both the file type and its permissions, you should mask off the file type portion and (s)printf using a C<"%o"> if you want to see the real permissions.
es_es: Dado que el modo contiene el tipo de archivo y sus permisos, debe desenmascarar la porción de tipo de archivo y usar (s)printf con C<"%o"> si desea ver los permisos reales.

source: An exception is raised if VERSION is greater than the version of the current Perl interpreter.
es_es: Se genera una excepción si VERSIÓN es mayor que la versión actual del intérprete de Perl.

source: More utf8 bugs fixed, notably in how C<chomp>, C<chop>, C<send>, and C<syswrite> and interact with utf8 data.
es_es: Más errores de utf8 arreglados, sobre todo en cómo C<chomp>, C<chop>, C<send>, y C<syswrite> interactuan con datos utf8.

source: The immediate, previous releases (i.e. perl5.8.x ) are usually maintained for a while, although not at the same level as the current releases.
es_es: Las versiones anteriores más recientes (en este caso, perl5.10.x) suelen mantenerse durante un tiempo, aunque en menor medida que las versiones actuales.

source: Perl statements end in a semi-colon:
es_es: Las instrucciones de Perl deben terminar con un signo de punto y coma:

source: =head2 What is perl.com?
es_es: =head2 ¿Qué es perl.com?

# (*** The previous line contains the naughty word "$1". )
source: (*** The previous line contains the naughty word "$1".\n)
es_es: (*** La línea anterior contiene la palabra juguetona "$1".\n)

source: with C<$1> being the line number for the next line, and C<$3> being the optional filename (specified with or without quotes).
es_es: con C<$1> siendo el número de línea para la línea siguiente y C<$3> siendo el nombre de archivo opcional (especificado con o sin comillas).

source: cybernetic pyrotechnics.
es_es: pirotecnia cibernética.

source: S<[ B<-C [I<number/list>] >]>
es_es: S<[ B<-C [I<número/lista>] >]>

source: The left argument is what is supposed to be searched, substituted, or transliterated instead of the default $_.
es_es: El argumento de la izquierda es lo que se supone que debe ser registrado, sustituido o transcrito en lugar del predeterminado $_.

source: =item reverse LIST X<reverse> X<rev> X<invert>
es_es: =item reverse LISTA X<reverse> X<rev> X<invert> X<invertir>

source: perlhacktips Tips for Perl core C code hacking
es_es: perlhacktips Consejos para modificar el código C del núcleo de Perl

source: printf '<%.*d>', 1, 0; # prints "<0>"
es_es: printf '<%.*d>', 1, 0; # imprime "<0>"

source: =item shmget KEY,SIZE,FLAGS X<shmget>
es_es: =item shmget CLAVE,TAMAÑO,BANDERAS X<shmget>

source: If MODE is C<< > >>, the file is opened for output, with existing files first being truncated ("clobbered") and nonexisting files newly created.
es_es: Si MODO es C<< > >>, el archivo es abierto para salida. Los archivos que ya existan serán truncados ("sobreescritos"); y los que no existan serán creados como nuevos archivos.

source: This keyword is enabled by the C<"switch"> feature: see L<feature> for more information.
es_es: Esta palabra clave se activa con la característica C<"switch">: vea L<feature> para más información

source: Returns the value of EXPR with all non-"word" characters backslashed.
es_es: Devuelve el valor de EXPR con todos los caracteres que no sean "palabra" con una barra invertida.

source: See also L<perlref>.
es_es: Ver también L<perlref>.

source: =head2 Designing your API
es_es: =head2 El diseño de su API

source: Prior to Perl version 5.9.1, the result of using an lvalue multiple times was unspecified.
es_es: Antes de la versión Perl 5.9.1, no estaba especificado el resultado de usar varias veces un I<ivalor>.

source: Use named parameters.
es_es: Use parámetros con nombre.

source: microperl is supposed to be a really minimal perl, even more minimal than miniperl.
es_es: microperl se supone que es realmente un perl mínimo, incluso aún más que el mínimo miniperl.

source: Beginning in November 2002, I<TPJ> moved to a reader-supported monthly e-zine format in which subscribers can download issues as PDF documents.
es_es: En noviembre de 2002, I<TPJ> se convirtió en un boletín electrónico mensual ofrecido como suscripción que se podía descargar en formato PDF.

source: In newer FreeBSD releases Perl 5.8.0 compilation failed because of trying to use F<malloc.h>, which in FreeBSD is just a dummy file, and a fatal error to even try to use.
es_es: En las versiones más recientes de FreeBSD Perl 5.8.0 la compilación falló debido a que trata de utilizar F<malloc.h>, que en FreeBSD es solo un archivo ficticio, y es un error fatal incluso el tratar de usarlo.

source: X<-> X<negation, arithmetic>
es_es: X<-> X<negation, arithmetic> X<negación, aritmética>

source: When a numeric value is passed as an argument to such an operator, it will be converted to the format understood by the operator.
es_es: Cuando se pasa un valor numérico como argumento a un operador así, se convierte a un formato comprensible para el operador.

source: The C<goto>-EXPR form expects a label name, whose scope will be resolved dynamically.
es_es: La forma C<goto>-EXPR espera un nombre de etiqueta, cuyo ámbito será resuelto dinámicamente.

source: $str is now in UTF-8 format.
es_es: $str está ahora en formato UTF-8.

source: Thus Perl allows such constructs, by I<forcefully breaking the infinite loop>.
es_es: Así, Perl permite tales construcciones, I<forzando la ruptura del bucle infinito>.

source: The caret allows for simpler stringification of compiled regular expressions.
es_es: El circunflejo permite la conversión sencilla a cadena de caracteres de las expresiones regulares compiladas.

source: Returns the new position, or the undefined value on failure.
es_es: Devuelve la nueva posición, o el valor indefinido en caso de error.

source: To capture a command's STDERR and STDOUT together:
es_es: Para capturar el STDOUT y STDERR del comando, juntos:

source: A few functions take no arguments at all, and therefore work as neither unary nor list operators.
es_es: Unas pocas funciones no toman ningún argumento, por lo que funcionan tanto como operadores unarios como operadores de lista.

source: Eventually, when a C<write> is done, the contents of C<$^A> are written to some filehandle.
es_es: Finalmente, cuando se hace un C<write>, los contenidos de C<$^A> se escriben al identificador de archivo.

source: ($him, $her) = @folks[0,-1]; # array slice
es_es: ($el, $ella) = @gente[0,-1]; # porción array

source: Returns true if successful, false on error.
es_es: Devuelve verdadero si tuvo éxito, falso en caso de error.

source: This is what you want for text files, but it can be disastrous for binary files.
es_es: Esto es lo que usted quiere para los archivos de texto, pero puede ser desastroso para archivos binarios.

source: If you feel the urge to write Perl modules, L<perlnewmod> will give you good advice.
es_es: Si desea escribir módulos de Perl, L<perlnewmod> le ayudará a empezar.

source: =item defined-or operator
es_es: =item Operador definido-or
